granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
static void             http_json_ok ();
static uint_fast8_t     http_get_on_off_value (const char * param, uint_fast8_t current_value);
static void             http_build_stm32_default_filename (char * stm32_default_filename, size_t max_len, const char ** filter);
static int              http_api_stm32_log ();
static int              http_api_stm32_log_clear ();
static int              http_api_remote_stm32_flash ();
static int              http_api_remote_esp_update ();
static int              http_api_device_ready ();
static int              http_api_reconnect_probe ();
static int              http_api_settings_xml ();
static int              http_api_display_power ();
static int              http_api_ambilight_power ();
static int              http_api_power_status ();
static int              http_api_update_progress ();
static uint_fast8_t     http_api_app_bundle_upload ();
static uint_fast8_t     http_filename_matches (const char * actual, const char * expected);
static uint_fast8_t     http_local_stm32_filename_matches (const char * actual);
static uint_fast8_t     http_remote_stm32_filename_matches (const char * actual);
static uint_fast8_t     http_table_download_filename_matches (const char * actual);
static void             http_remove_table_family_files (const char * keep_filename);
static int              http_api_live_display_color ();
static const char *     http_get_configured_icon_filename (void);
static const char *     http_get_configured_weather_filename (void);
static const char *     http_find_existing_filename (const char * preferred, const char * const * candidates, size_t candidate_count);
static String           sanitize_json_string (const String& str);

typedef struct
{
    uint_fast8_t    active;
    char            type[16];
    char            state[24];
    char            message[128];
    uint32_t        progress_current;
    uint32_t        progress_total;
    uint32_t        error_code;
    uint32_t        started_at;
    uint32_t        updated_at;
    uint32_t        finished_at;
} UPDATE_PROGRESS;

static UPDATE_PROGRESS   update_progress;

static void
update_progress_copy (char * dst, size_t dst_size, const char * src)
{
    if (! dst || ! dst_size)
    {
        return;
    }

    strncpy (dst, src ? src : "", dst_size - 1);
    dst[dst_size - 1] = '\0';
}

static uint_fast8_t
http_filename_matches (const char * actual, const char * expected)
{
    return actual && expected && ! strcmp (actual, expected) ? 1 : 0;
}

static uint_fast8_t
http_tables_filename_matches (const char * actual, const char * target_filename)
{
    size_t expected_prefix_len;

    if (! actual || ! target_filename)
    {
        return 0;
    }

    expected_prefix_len = strlen (target_filename);

    if (expected_prefix_len < strlen ("local.txt"))
    {
        return 0;
    }

    expected_prefix_len -= strlen ("local.txt");

    if (strncmp (actual, target_filename, expected_prefix_len))
    {
        return 0;
    }

    return strstr (actual, ".txt") && ! strcmp (actual + strlen (actual) - 4, ".txt") ? 1 : 0;
}

static const char *
http_get_configured_icon_filename (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-icon.txt";
        case HW_WC_12H: return "wc12h-icon.txt";
        case HW_UCLOCK: return "uc-icon.txt";
    }

    return (const char *) 0;
}

static const char *
http_get_configured_weather_filename (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-weather.txt";
        case HW_WC_12H: return "wc12h-weather.txt";
        case HW_UCLOCK: return "uc-weather.txt";
    }

    return (const char *) 0;
}

static const char *
http_get_tables_family_prefix (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-tables-";
        case HW_WC_12H: return "wc12h-tables-";
    }

    return (const char *) 0;
}

static const char *
http_get_default_layout_preview_filename (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h-tables-de.txt";
        case HW_WC_12H: return "wc12h-tables-de.txt";
    }

    return (const char *) 0;
}

static uint_fast8_t
http_get_default_layout_columns (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return 11;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return 18;
        case HW_WC_12H: return 11;
        default: return 11;
    }
}

static const char *
http_get_asset_prefix (void)
{
    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "wc24h";
        case HW_WC_12H: return "wc12h";
        case HW_UCLOCK: return "uc";
    }

    return (const char *) 0;
}

static const char *
http_get_hardware_label (void)
{
    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H: return "WC24h";
        case HW_WC_12H: return "WC12h";
        case HW_UCLOCK: return "uClock";
    }

    return "unbekannt";
}

static const char *
http_get_processor_label (void)
{
    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8: return "STM32F103C8";
        case HW_STM32_F401RE: return "STM32F401RE";
        case HW_STM32_F411RE: return "STM32F411RE";
        case HW_STM32_F446RE: return "STM32F446RE";
        case HW_STM32_F407VE: return "STM32F407VE";
        case HW_STM32_F401CC: return "STM32F401CC";
        case HW_STM32_F411CE: return "STM32F411CE";
    }

    return "unbekannt";
}

static const char *
http_get_board_label (void)
{
    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8: return "BluePill";
        case HW_STM32_F401RE:
        case HW_STM32_F411RE:
        case HW_STM32_F446RE: return "Nucleo";
        case HW_STM32_F407VE: return "BlackBoard";
        case HW_STM32_F401CC:
        case HW_STM32_F411CE: return "BlackPill";
    }

    return "unbekannt";
}

static const char *
http_get_frequency_label (void)
{
    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8: return "72 MHz";
        case HW_STM32_F401RE: return "84 MHz";
        case HW_STM32_F411RE: return "100 MHz";
        case HW_STM32_F446RE: return "180 MHz";
        case HW_STM32_F407VE: return "168 MHz";
        case HW_STM32_F401CC: return "84 MHz";
        case HW_STM32_F411CE: return "100 MHz";
    }

    return "unbekannt";
}

static const char *
http_get_oscillator_label (void)
{
    switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
    {
        case HW_OSC_FREQUENCY_8MHZ: return "8 MHz";
        case HW_OSC_FREQUENCY_25MHZ: return "25 MHz";
    }

    return "unbekannt";
}

static const char *
http_get_display_label (void)
{
    switch (hardware_configuration & HW_LED_MASK)
    {
        case HW_LED_WS2812_GRB_LED: return "WS2812 GRB";
        case HW_LED_WS2812_RGB_LED: return "WS2812 RGB";
        case HW_LED_APA102_RGB_LED: return "APA102 RGB";
        case HW_LED_SK6812_RGB_LED: return "SK6812 RGB";
        case HW_LED_SK6812_RGBW_LED: return "SK6812 RGBW";
        case HW_LED_TFTLED_RGB_LED: return "TFT RGB";
    }

    return "unbekannt";
}

static const char *
http_get_display_led_mode (void)
{
    switch (hardware_configuration & HW_LED_MASK)
    {
        case HW_LED_SK6812_RGBW_LED: return "rgbw";
        case HW_LED_WS2812_GRB_LED:
        case HW_LED_WS2812_RGB_LED:
        case HW_LED_APA102_RGB_LED:
        case HW_LED_SK6812_RGB_LED: return "rgb";
        case HW_LED_TFTLED_RGB_LED: return "tft";
    }

    return "none";
}

static void
http_json_send_field_prefix (const char * key)
{
    http_send (FS(",\""));
    http_send (key);
    http_send (FS("\":"));
}

static void
http_json_send_bool_field (const char * key, uint_fast8_t value)
{
    http_json_send_field_prefix (key);
    http_send (value ? "true" : "false");
}

static void
http_json_send_uint_field (const char * key, unsigned long value)
{
    http_json_send_field_prefix (key);
    http_send (String (value).c_str ());
}

static void
http_json_send_string_field (const char * key, const char * value)
{
    http_json_send_field_prefix (key);
    http_send (FS("\""));
    http_send (sanitize_json_string (value ? value : "").c_str ());
    http_send (FS("\""));
}

static void
http_json_send_string_field (const char * key, const String& value)
{
    http_json_send_string_field (key, value.c_str ());
}

static const char *
http_get_local_update_message (uint32_t flashsize)
{
    if (flashsize < 1048576UL)
    {
        return "Lokales Update ist bei dieser ESP-Flashgroesse nicht verfuegbar.";
    }

    return "ESP- oder STM32-Datei auswaehlen und direkt lokal hochladen.";
}

static const char *
http_find_existing_filename (const char * preferred, const char * const * candidates, size_t candidate_count)
{
    size_t idx;

    if (preferred && LittleFS.exists (preferred))
    {
        return preferred;
    }

    for (idx = 0; idx < candidate_count; idx++)
    {
        const char * candidate = candidates[idx];

        if (candidate && (! preferred || strcmp (candidate, preferred)) && LittleFS.exists (candidate))
        {
            return candidate;
        }
    }

    return preferred;
}

static uint_fast8_t
http_local_stm32_filename_matches (const char * actual)
{
    char            default_filename[MAX_UPDATE_FILENAME_LEN];
    const char *    filter = (const char *) NULL;

    if (! actual)
    {
        return 0;
    }

    http_build_stm32_default_filename (default_filename, sizeof (default_filename), &filter);

