granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (! p)
    {
        return "text/plain";
    }

    if (! strcmp (p, ".html"))
    {
        return "text/html; charset=utf-8";
    }
    else if (! strcmp (p, ".css"))
    {
        return "text/css; charset=utf-8";
    }
    else if (! strcmp (p, ".js"))
    {
        return "application/javascript; charset=utf-8";
    }
    else if (! strcmp (p, ".webmanifest"))
    {
        return "application/manifest+json; charset=utf-8";
    }
    else if (! strcmp (p, ".json"))
    {
        return "application/json; charset=utf-8";
    }
    else if (! strcmp (p, ".svg"))
    {
        return "image/svg+xml";
    }
    else if (! strcmp (p, ".png"))
    {
        return "image/png";
    }
    else if (! strcmp (p, ".ico"))
    {
        return "image/x-icon";
    }

    return "text/plain";
}

static uint_fast8_t
http_send_fs_file (const char * filename, const char * content_type)
{
    uint_fast8_t    rtc = 0;

    LittleFS.begin ();

    if (LittleFS.exists (filename))
    {
        File fp = LittleFS.open (filename, "r");

        if (fp)
        {
            http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: "));
            http_send (content_type);
            http_send (FS("\r\nCache-Control: no-cache\r\n\r\n"));

            while (fp.available ())
            {
                char    buf[257];
                size_t  len = fp.readBytes (buf, sizeof (buf) - 1);

                if (len > 0)
                {
                    buf[len] = '\0';
                    http_send (buf);
                }
            }

            fp.close ();
            http_flush ();
            rtc = 1;
        }
    }

    LittleFS.end ();

    return rtc;
}

static bool
http_app_installation_complete (void)
{
    static const char * required_files[] =
    {
        "app-index.html",
        "app-app.js",
        "app-styles.css",
        "app-manifest.webmanifest",
        "app-sw.js",
        "app-icons-icon-192.svg",
        "app-icons-icon-512.svg"
    };
    uint_fast8_t idx;
    bool rtc = true;

    LittleFS.begin ();

    for (idx = 0; idx < sizeof (required_files) / sizeof (required_files[0]); idx++)
    {
        if (! LittleFS.exists (required_files[idx]))
        {
            rtc = false;
            break;
        }
    }

    LittleFS.end ();
    return rtc;
}

static bool         download_file (const char * host, const char * path, const char * filename);
static int          install_app_bundle (const char * bundle_filename);

static int
http_try_auto_install_app_bundle (void)
{
    int         download_rtc = 0;
    int         app_bundle_rtc = 0;
    STR_VAR *   sv;
    char *      update_host;
    char *      update_path;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    LittleFS.begin ();
    download_rtc = download_file (update_host, update_path, APP_BUNDLE_FILENAME);
    LittleFS.end ();

    if (download_rtc == 1)
    {
        app_bundle_rtc = install_app_bundle (APP_BUNDLE_FILENAME);
    }

    return (download_rtc == 1 && app_bundle_rtc == 1) ? 1 : 0;
}

static bool
app_asset_filename (const char * asset_path, char * filename, size_t maxlen)
{
    size_t idx = 0;

    if (! asset_path || ! *asset_path)
    {
        return false;
    }

    for (const char * p = asset_path; *p && idx < maxlen - 1; p++)
    {
        if (*p == '/')
        {
            filename[idx++] = '-';
        }
        else
        {
            filename[idx++] = *p;
        }
    }

    filename[idx] = '\0';
    return idx > 0;
}

static uint_fast8_t
http_app (const char * path)
{
    char            filename[128];
    const char *    content_type;
    uint_fast8_t    is_pwa_index = 0;
    uint_fast8_t    sent = 0;
    bool            app_complete;

    if (! strcmp (path, PWA_PREFIX) || ! strcmp (path, PWA_PREFIX "/"))
    {
        strncpy (filename, PWA_INDEX_FILE, sizeof (filename) - 1);
        filename[sizeof (filename) - 1] = '\0';
        is_pwa_index = 1;
    }
    else if (! strncmp (path, PWA_PREFIX "/", strlen (PWA_PREFIX "/")))
    {
        char asset_path[128];

        snprintf (asset_path, sizeof (asset_path), "app/%s", path + strlen (PWA_PREFIX "/"));

        if (! app_asset_filename (asset_path, filename, sizeof (filename)))
        {
            http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\n\r\nPWA asset not found\r\n"));
            http_flush ();
            return 0;
        }
    }
    else
    {
        return 0;
    }

    content_type = http_content_type (filename);
    app_complete = http_app_installation_complete ();

    if (! is_pwa_index || app_complete)
    {
        sent = http_send_fs_file (filename, content_type);
    }

    if (sent)
    {
        return 0;
    }

    if (! sent)
    {
        if (is_pwa_index)
        {
            http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: text/html; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));
            http_send (FS(
                "<!DOCTYPE html><html><head><meta charset='utf-8'>"
                "<meta name='viewport' content='width=device-width, initial-scale=1'>"
                "<title>WordClock App noch nicht installiert</title>"
                "<style>"
                "body{font-family:Arial,sans-serif;background:#0b1422;color:#eef4ff;padding:24px;line-height:1.5;}"
                ".card{max-width:680px;margin:0 auto;background:#132033;border:1px solid rgba(255,255,255,.08);"
                "border-radius:18px;padding:24px;box-shadow:0 20px 50px rgba(0,0,0,.25);}"
                "h1{margin:0 0 12px;font-size:28px;}p{color:#c5d3ea;}a{display:inline-block;margin:8px 12px 0 0;"
                "padding:12px 16px;border-radius:999px;text-decoration:none;background:#2d5275;color:#fff;"
                "border:1px solid rgba(255,255,255,.15);}strong{color:#fff;}"
                "</style></head><body><div class='card'>"
                "<h1>WordClock App ist noch nicht installiert</h1>"
                "<p>Auf diesem Gerät wurden noch keine vollständigen App-Dateien in das LittleFS geladen.</p>"
                "<p><strong>Weiter so:</strong> App-Paket manuell über die Legacy-Seite installieren oder Update-Host/-Pfad prüfen.</p>"
                "<a href='/fs'>Zu Dateien / App-Paket</a>"
                "<a href='/update'>Zu Update</a>"
                "<a href='/'>Zur Legacy-Seite</a>"
                "</div></body></html>"
            ));
        }
        else
        {
            http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\n\r\nPWA asset not found\r\n"));
        }
        http_flush ();
    }

