granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * normalize http parameters
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
normalize_http_parameters (char * p)
{
    while (*p)
    {
        if (*p == '%')
        {
            char * pp;

            *p = htoi (p + 1, 2);

            for (pp = p + 1; *(pp + 2); pp++)
            {
                *pp = *(pp + 2);
            }
            *pp = '\0';
        }
        p++;
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * set parameters from list
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
http_set_params (char * paramlist)
{
    char *  p;                                              // ap=access&pw=secret&action=saveap
    int     idx = 0;
    int     i;

    if (paramlist && *paramlist)
    {
        http_parameters[idx].name = paramlist;

        for (p = paramlist; idx < MAX_HTTP_PARAMS - 1 && *p; p++)
        {
            if (*p == '=')
            {
                *p = '\0';
                http_parameters[idx].value = p + 1;
            }
            else if (*p == '&')
            {
                *p = '\0';
                idx++;
                http_parameters[idx].name = p + 1;
            }
        }
        idx++;
    }

    for (i = 0; i < idx; i++)
    {
        normalize_http_parameters (http_parameters[i].value);
    }

    while (idx < MAX_HTTP_PARAMS)
    {
        http_parameters[idx].name = (char *) 0;
        idx++;
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * get a parameter
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static char *
http_get_param (const char * name)
{
    static char empty[] = "";
    int     idx;

    for (idx = 0; idx < MAX_HTTP_PARAMS && http_parameters[idx].name != (char *) 0; idx++)
    {
        if (! strcmp (http_parameters[idx].name, name))
        {
            return http_parameters[idx].value;
        }
    }

    return empty;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * get a parameter by index
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static char *
http_get_param_by_idx (const char * name, int idx)
{
    char    name_buf[16];
    char *  rtc;

    sprintf (name_buf, "%s%d", name, idx);
    rtc = http_get_param (name_buf);

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * get a checkbox parameter
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static int
http_get_checkbox_param (const char * name)
{
    char *  value = http_get_param (name);
    int     rtc;

    if (! strcmp (value, "active"))
    {
        rtc = 1;
    }
    else
    {
        rtc = 0;
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * get a checkbox parameter by index
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static int
http_get_checkbox_param_by_idx (const char * name, int idx)
{
    char *  value = http_get_param_by_idx (name, idx);
    int     rtc;

    if (! strcmp (value, "active"))
    {
        rtc = 1;
    }
    else
    {
        rtc = 0;
    }

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * send http style
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
http_style (void)
{
    http_send_FS ("<style>\r\n");
    http_send_FS ("* { padding: 0; margin: 0; FONT-FAMILY: Verdana,Helvetica,sans-serif; FONT-SIZE: 14px}\r\n");
    http_send_FS ("BODY, HTML {height: 100%}\r\n");
    http_send_FS ("H1 {FONT-SIZE: 24px}\r\n");
    http_send_FS ("H2 {FONT-SIZE: 18px}\r\n");
    http_send_FS ("H3 {FONT-SIZE: 16px}\r\n");
    http_send_FS ("TH {color: darkblue}\r\n");
    http_send_FS ("A {text-decoration: none}\r\n");
    http_send_FS (".nav-pane {color: #ffffff}\r\n");
    http_send_FS (".content-pane {color: #000000}\r\n");
    http_send_FS (".nav-pane a:link, .nav-pane a:visited {background: none; color: #eeee00}\r\n");
    http_send_FS (".nav-pane a:hover {background: none; color: #ffffff}\r\n");
    http_send_FS (".nav-pane a:active {background: none; color: #ffff00}\r\n");
    http_send_FS (".content-pane a:link {background: none; color: #0000cc}\r\n");
    http_send_FS (".content-pane a:visited {background: none; color: #551a8b}\r\n");
    http_send_FS (".content-pane a:hover {background: none; color: #000099}\r\n");
    http_send_FS (".content-pane a:active {background: none; color: #cc0000}\r\n");
    http_send_FS ("SELECT,BUTTON,.button,.custom-file-upload\r\n");
    http_send_FS ("{\r\n");
    http_send_FS (" background: none;\r\n");
    http_send_FS (" border: 1px solid;\r\n");
    http_send_FS (" border-color: #0000ff;\r\n");
    http_send_FS (" color: #0000ff;\r\n");
    http_send_FS (" padding: 4px 8px;\r\n");
    http_send_FS (" text-align: center;\r\n");
    http_send_FS (" text-decoration: none;\r\n");
    http_send_FS (" display: inline-block;\r\n");
    http_send_FS (" font-size: 12px;\r\n");
    http_send_FS (" margin: 4px 2px;\r\n");
    http_send_FS (" cursor: pointer;\r\n");
    http_send_FS ("}\r\n");
    http_send_FS ("BUTTON:hover\r\n");
    http_send_FS ("{\r\n");
    http_send_FS (" background-color: #0000B0;\r\n");
    http_send_FS (" color: #ffff00;\r\n");
    http_send_FS ("}\r\n");
    http_send_FS ("input[type=\"file\"] { display: none; }");
    http_send_FS (".bigtable {height: 100%}\r\n");
    http_send_FS ("</style>\r\n");
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * send http and html header
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
http_header (const char * title, const char * refresh, const char * url)
{
    http_send_FS ("HTTP/1.0 200 OK\r\nContent-Type: text/html; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n<!DOCTYPE html>\r\n<html><head><meta charset=\"utf-8\"><title>");

    http_send (pgm_name);

    if (title && *title)
    {
        http_send (" ");
        http_send (title);
    }

    http_send_FS ("</title>");

    if (refresh)
    {
        http_send_FS ("<meta http-equiv=\"refresh\" content=\"");
        http_send (refresh);
        http_send_FS ("; URL=");
        http_send (url);
        http_send_FS ("\">");
    }

