granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    begin_table_row_form (page);
    text_column (text);
    cols_used++;
    input_column (id, "", value, maxlength, maxlength);
    cols_used++;
    button_column (buttonid, buttontext);
    cols_used++;

    while (cols_used < cols)
    {
        http_send_FS ("<td></td>");
        cols_used++;
    }

    save_column (id);
    end_table_row_form ();
}
#endif
/*-------------------------------------------------------------------------------------------------------------------------------------------
 * table row with multiple inputs
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
table_row_inputs (const char * page, const char * id, int n, const char ** ids, const char ** desc, const char ** value, int * maxlength, int * maxsize)
{
    int     i;

    begin_table_row_form (page);

    for (i = 0; i < n; i++)
    {
        http_send_FS ("<td>");
        input_field (ids[i], desc[i], value[i], maxlength[i], maxsize[i]);
        http_send_FS ("</td>");
    }

    save_column (id);
    end_table_row_form ();
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * table row with checkbox
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
table_row_checkbox (const char * page, const char * text, const char * id, const char * desc, int checked)
{
    begin_table_row_form (page);
    text_column (text);
    checkbox_column (id, desc, checked);
    save_column (id);
    end_table_row_form ();
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * table row with selection
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
table_row_select (const char * page, const char * text1, const char * id, const char ** text2, int selected_value, int min_value, int max_value, int autosubmit)
{
    begin_table_row_form (page);
    text_column (text1);
    select_column (id, text2, selected_value, min_value, max_value, autosubmit);
    save_column (id);
    end_table_row_form ();
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * table row with slider
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
table_row_slider (const char * page, const char * text1, const char * id, const char * text2, const char * min, const char * max)
{
    begin_table_row_form (page);
    text_column (text1);
    slider_column (id, text2, min, max);
    save_column (id);
    end_table_row_form ();
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * table row with n sliders
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
table_row_sliders (const char * page, const char * text1, const char * id, int n, const char ** ids, const char ** desc, const char * const * text2, const char ** min, const char ** max)
{
    int i;

    begin_table_row_form (page);
    text_column (text1);

    http_send_FS ("<td>");

    for (i = 0; i < n; i++)
    {
        slider_field (ids[i], desc[i], text2[i], min[i], max[i], "64");
        http_send_FS ("&nbsp;&nbsp;&nbsp;\r\n");
    }

    http_send_FS ("</td>\r\n");

    save_column (id);
    end_table_row_form ();
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * table trailer
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
table_trailer (void)
{
    http_send_FS ("</table><P>\r\n");
}

static void
menu_entry (const char * page, const char * entry)
{
    http_send_FS ("<a href=\"/");
    http_send (page);
    http_send_FS ("\" style=\"text-decoration: none\">");
    http_send (entry);
    http_send_FS ("</a><BR>");
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * menu
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static void
begin_box (const char * title)
{
    http_send_FS ("<table class=\"bigtable\"><tr><td class=\"nav-pane\" style=\"padding:10px\" valign=\"top\" bgcolor=\"#000080\">"
                  "<font color=white><H1>");

    http_send (pgm_name);

    http_send_FS ("</H1></font><BR>\r\n");

    menu_entry ("", "Main");
    menu_entry ("network", "Network");
    menu_entry ("temperature", "Temperature");
    menu_entry ("weather", "Weather");
    menu_entry ("ldr", "LDR");
    menu_entry ("dispbright", "Brightness");
    menu_entry ("ambibright", "Ambilight Brightness");
    menu_entry ("display", "Display");
    menu_entry ("animations", "Animations");
    menu_entry ("overlays", "Overlays");
    menu_entry ("ambilight", "Ambilight");
    menu_entry ("timers", "Timers");
    menu_entry ("atimers", "Ambilight Timers");
    menu_entry ("dfplayer", "DFPlayer");

    if (hardware_configuration != 0xFFFF && (hardware_configuration & HW_LED_MASK) == HW_LED_TFTLED_RGB_LED)
    {
        menu_entry ("tft", "TFT");
    }

    menu_entry ("fs", "Files");
    menu_entry ("update", "Update");
    menu_entry ("flash_stm32_local", "Local Update");
    http_send_FS ("<a href=\"/app/\" style=\"text-decoration: none\"><font color=#ffff00><B>New App</B></font></a><BR>");

    http_send_FS ("</td><td class=\"content-pane\" style=\"padding:10px\"  align=\"left\" valign=\"top\">\r\n");      // fm: center?

    if (title && *title)
    {
        http_send_FS ("<H1>");
        http_send (title);
        http_send_FS ("</H1><BR>");
    }
}

static void
end_box (void)
{
    http_send_FS ("</td></tr></table>\r\n");
}

static uint_fast8_t
icon_files_exist (void)
{
    static const char * const icon_candidates[] = { "wc24h-icon.txt", "wc12h-icon.txt", "uc-icon.txt" };
    static const char * const weather_candidates[] = { "wc24h-weather.txt", "wc12h-weather.txt", "uc-weather.txt" };
    const char *    fname_icon;
    const char *    fname_weather;
    uint_fast8_t    rtc = 0;

    LittleFS.begin();
    fname_icon = http_find_existing_filename (http_get_configured_icon_filename (), icon_candidates, sizeof (icon_candidates) / sizeof (icon_candidates[0]));
    fname_weather = http_find_existing_filename (http_get_configured_weather_filename (), weather_candidates, sizeof (weather_candidates) / sizeof (weather_candidates[0]));

    if (fname_icon && fname_weather && LittleFS.exists(fname_icon) && LittleFS.exists(fname_weather))
    {
        rtc = 1;
    }

    LittleFS.end();
    return rtc;
}

static void
message_icon_files_missing (void)
{
    if (! icon_files_exist ())
    {
        http_send_FS ("<font color=\"red\"><B>Please install the icon files onto <a href=\"fs\">FS</a></B></font><P>\r\n");
    }
}

static void
message_tables_file_missing (void)
{
    if (! tables_fname())
    {
        if (hardware_configuration != 0xFFFF && (hardware_configuration & HW_WC_MASK) != HW_UCLOCK)
        {
            http_send_FS ("<font color=\"red\"><B>Please install the layout table file wcxx-tables-xx.txt onto <a href=\"fs\">FS</a></B></font><P>\r\n");
        }
    }
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * main page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
static uint_fast8_t
http_main (void)
{
    const char *    thispage = "";
    const char *    header_cols[MAIN_HEADER_COLS]               = { "Name", "Value" };
    const char *    datetime_header_cols[DATETIME_HEADER_COLS]  = { "YYYY", "MM", "DD", "hh", "mm", "Action" };
    const char *    ids[5]                                      = { "year", "month", "day", "hour", "min" };
    const char *    desc[5]                                     = { "", "", "", "", "" };
    int             maxlen[5]                                   = { 4, 2, 2, 2, 2 };
    int             maxsize[5]                                  = { 4, 2, 2, 2, 2 };
    char            year_str[16];
    char            mon_str[16];
    char            day_str[16];
    char            hour_str[16];
    char            minutes_str[16];
    const char *    values[5]                                   = { year_str, mon_str, day_str, hour_str, minutes_str };
    char *          action;
    const char *    message                                     = (const char *) 0;
    STR_VAR *       sv;
    const char *    esp_firmware_version                        = ESP_VERSION;
    char *          version;
    char *          eeprom_version;
    uint_fast8_t    rtc                                         = 0;
    struct tm *     tmp;
    uint_fast8_t    eeprom_is_up;
    uint_fast8_t    rtc_is_up;
    uint_fast8_t    dfplayer_is_up;
    uint_fast16_t   dfplayer_version;
    uint_fast8_t    do_reset = 0;
    uint_fast8_t    do_reset_eeprom = 0;

    sv              = get_strvar (VERSION_STR_VAR);
    version         = sv->str;

    sv              = get_strvar (EEPROM_VERSION_STR_VAR);
    eeprom_version  = sv->str;

    tmp = get_tm_var (CURRENT_TM_VAR);

    if (tmp->tm_year >= 0 && tmp->tm_mon >= 0 && tmp->tm_mday >= 0 && tmp->tm_hour >= 0 && tmp->tm_min >= 0 &&
        tmp->tm_year <= 1200 && tmp->tm_mon <= 12 && tmp->tm_mday <= 31 && tmp->tm_hour < 24 && tmp->tm_min < 60)
    {                                                               // check values to avoid buffer overflow
        sprintf (year_str,      "%4d",  tmp->tm_year + 1900);
        sprintf (mon_str,       "%02d", tmp->tm_mon + 1);
        sprintf (day_str,       "%02d", tmp->tm_mday);
        sprintf (hour_str,      "%02d", tmp->tm_hour);
        sprintf (minutes_str,   "%02d", tmp->tm_min);
    }
    else
    {
        year_str[0]     = '\0';
        mon_str[0]      = '\0';
        day_str[0]      = '\0';
        hour_str[0]     = '\0';
        minutes_str[0]  = '\0';
    }

    rtc_is_up         = get_numvar (RTC_IS_UP_NUM_VAR);
    eeprom_is_up      = get_numvar (EEPROM_IS_UP_NUM_VAR);
    dfplayer_is_up    = get_numvar (DFPLAYER_IS_UP_NUM_VAR);
    dfplayer_version  = get_numvar (DFPLAYER_VERSION_NUM_VAR);

    action = http_get_param ("action");

    if (*action)
    {
        if (! strcmp (action, "learnir"))
        {
            message = "Learning IR remote control...";
            rpc (LEARN_IR_RPC_VAR);
        }
        else if (! strcmp (action, "poweron"))
        {
            message = "Switching power on...";
            set_numvar (DISPLAY_POWER_NUM_VAR, 1);
        }
        else if (! strcmp (action, "poweroff"))
        {
            message = "Switching power off...";
            set_numvar (DISPLAY_POWER_NUM_VAR, 0);
        }
        else if (! strcmp (action, "apoweron"))
        {
            message = "Switching ambilight power on...";
            set_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR, 1);
        }
        else if (! strcmp (action, "apoweroff"))
        {
            message = "Switching ambilight power off...";
            set_numvar (DISPLAY_AMBILIGHT_POWER_NUM_VAR, 0);
        }
        else if (! strcmp (action, "rststm32"))
        {
            message = "Resetting STM32...";
            do_reset = 1;
        }
        else if (! strcmp (action, "rsteeprom"))
        {
            do_reset_eeprom = 1;
        }
        else if (! strcmp (action, "rsteeprom2"))
        {
            message = "Resetting EEPROM, you should now restart STM32...";
            rpc (RESET_EEPROM_RPC_VAR);
            do_reset_eeprom = 2;
        }
        else if (! strcmp (action, "savedatetime"))
        {
            TM tm;

            int year    = atoi (http_get_param ("year"));
            int month   = atoi (http_get_param ("month"));
            int day     = atoi (http_get_param ("day"));
            int hour    = atoi (http_get_param ("hour"));
            int minutes = atoi (http_get_param ("min"));

            sprintf (year_str,      "%4d",  year);
            sprintf (mon_str,       "%02d", month);
            sprintf (day_str,       "%02d", day);
            sprintf (hour_str,      "%02d", hour);
            sprintf (minutes_str,   "%02d", minutes);

            tm.tm_year  = year - 1900;
            tm.tm_mon   = month - 1;
            tm.tm_mday  = day;
            tm.tm_hour  = hour;
            tm.tm_min   = minutes;
            tm.tm_sec   = 0;
            tm.tm_wday  = dayofweek (day, month, year);

            set_tm_var (CURRENT_TM_VAR, &tm);
        }
        else if (! strcmp (action, "saveticker"))
        {
            char * ticker = http_get_param ("ticker");
            set_strvar (TICKER_TEXT_STR_VAR, ticker);
        }
    }

    if (do_reset)
    {
        http_header ("Reset", "20", "/");
    }
    else
    {
        http_header ("", (const char *) NULL, (const char *) NULL);
    }

    begin_box ("Main");

    if (do_reset_eeprom == 1)
    {
        begin_form (thispage);
        http_send_FS ("<P><B>Are you really shure to set all EEPROM values to factory settings?</B>\r\n");
        button_field ("rsteeprom2", "YES, Reset EEPROM!");
        end_form ();
        end_box ();
        http_trailer ();
        http_flush ();
    }
    else if (do_reset_eeprom == 2)
    {
        begin_form (thispage);
        http_send_FS ("<P><B>You should now restart STM32</B><BR>\r\n");
        button_field ("rststm32", "Restart STM32");
        end_form ();
        end_box ();
        http_trailer ();
        http_flush ();
    }
    else if (do_reset)
    {
        http_send_FS ("<P><B>Resetting STM32, reconnecting in 20 seconds ...</B><BR>\r\n");
        end_box ();
        http_trailer ();
        http_flush ();
        delay (200);
        stm32_reset ();
    }
    else
    {
        const char * proc     = "unknown";
        const char * osc      = "unknown";
        const char * freq     = "unknown";
        const char * board    = "unknown";
        const char * led_type = "unknown";

        switch (hardware_configuration & HW_STM32_MASK)
        {
            case HW_STM32_F103C8:   proc = "STM32F103C8"; board = "BluePill";   freq = "72MHz";   break;
            case HW_STM32_F401RE:   proc = "STM32F401RE"; board = "Nucleo";     freq = "84MHz";   break;
            case HW_STM32_F411RE:   proc = "STM32F411RE"; board = "Nucleo";     freq = "100MHz";  break;
            case HW_STM32_F446RE:   proc = "STM32F446RE"; board = "Nucleo";     freq = "180MHz";   break;
            case HW_STM32_F407VE:   proc = "STM32F407VE"; board = "BlackBoard"; freq = "168MHz";   break;
            case HW_STM32_F401CC:   proc = "STM32F401CC"; board = "BlackPill";  freq = "84MHz";   break;
            case HW_STM32_F411CE:   proc = "STM32F411CE"; board = "BlackPill";  freq = "100MHz";  break;
        }

        switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
        {
            case HW_OSC_FREQUENCY_8MHZ:   osc = "8 MHz";            break;
            case HW_OSC_FREQUENCY_25MHZ:  osc = "25 MHz";           break;
        }
        switch (hardware_configuration & HW_LED_MASK)
        {
            case HW_LED_WS2812_GRB_LED:   led_type = "WS2812 GRB";  break;
            case HW_LED_WS2812_RGB_LED:   led_type = "WS2812 RGB";  break;
            case HW_LED_APA102_RGB_LED:   led_type = "APA102 GRB";  break;
            case HW_LED_SK6812_RGB_LED:   led_type = "SK6812 RGB";  break;
            case HW_LED_SK6812_RGBW_LED:  led_type = "SK6812 RGBW"; break;
            case HW_LED_TFTLED_RGB_LED:   led_type = "TFT RGB";     break;
        }

        message_tables_file_missing ();

        http_send_FS ("<table><tr valign=\"top\"><td>\r\n");
        table_header (header_cols, MAIN_HEADER_COLS);
        table_row ("Board", board, "");
        table_row ("Processor", proc, "");
        table_row ("Oscillator", osc, "");
        table_row ("Frequency", freq, "");
        table_row ("Hardware", hardware, "");
        table_row ("Display", led_type, "");
        table_row ("Version", version, "");
        table_row ("ESP8266 version", esp_firmware_version, "");
        table_trailer ();

        http_send_FS ("</td><td>\r\n");
        table_header (header_cols, MAIN_HEADER_COLS);
        table_row ("RTC", rtc_is_up ? "online" : "offline", "");
        table_row ("EEPROM", eeprom_is_up ? "online" : "offline", "");

        if (eeprom_is_up)
        {
            table_row ("EEPROM Version", eeprom_version, "");
        }

        table_row ("DFPlayer", dfplayer_is_up ? "online" : "offline", "");

        if (dfplayer_is_up)
        {
            char dfplayer_version_buf[16];
    
            sprintf (dfplayer_version_buf, "%04x", dfplayer_version);
            table_row ("DFPlayer Version", dfplayer_version_buf, "");
        }

        table_row ("Display power", get_numvar (DISPLAY_POWER_NUM_VAR) ? "on" : "off", "");
        table_trailer ();
        http_send_FS ("</td></tr></table><BR>\r\n");

        table_header (datetime_header_cols, DATETIME_HEADER_COLS);
        table_row_inputs (thispage, "datetime", 5, ids, desc, values, maxlen, maxsize);
        table_trailer ();

