granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
                at = get_alarm_time_var ((ALARM_TIME_VARIABLE) idx);

                flags = at->flags;

                if (http_get_checkbox_param_by_idx ("a", idx))
                {
                    flags |= ALARM_TIME_FLAG_ACTIVE;
                }
                else
                {
                    flags &= ~ALARM_TIME_FLAG_ACTIVE;
                }

                sprintf (id, "f%d", idx);
                from_day = atoi (http_get_param (id));
                sprintf (id, "t%d", idx);
                to_day = atoi (http_get_param (id));

                flags &= ~(ALARM_TIME_FROM_DAY_MASK | ALARM_TIME_TO_DAY_MASK);
                flags |= ALARM_TIME_FROM_DAY_MASK & (from_day << 3);
                flags |= ALARM_TIME_TO_DAY_MASK & (to_day);

                minutes = atoi (http_get_param_by_idx ("h", idx)) * 60 + atoi (http_get_param_by_idx ("m", idx));

                set_alarm_time_var ((ALARM_TIME_VARIABLE) idx, minutes, flags);
            }
        }
        else if (! strcmp (action, "play"))
        {
            folder = atoi (http_get_param ("plfolder"));
            track  = atoi (http_get_param ("pltrack"));
            set_numvar (DFPLAYER_PLAY_FOLDER_TRACK_NUM_VAR, folder << 8 | track);
        }
    }

    http_header ("DFPlayer", (const char *) NULL, (const char *) NULL);
    begin_box ("DFPlayer");

    volume        = get_numvar (DFPLAYER_VOLUME_NUM_VAR);
    silence_start = get_numvar (DFPLAYER_SILENCE_START_NUM_VAR);
    silence_stop  = get_numvar (DFPLAYER_SILENCE_STOP_NUM_VAR);
    dfplayer_mode = get_numvar (DFPLAYER_MODE_NUM_VAR);
    bell_flags    = get_numvar (DFPLAYER_BELL_FLAGS_NUM_VAR);
    speak_cycle   = get_numvar (DFPLAYER_SPEAK_CYCLE_NUM_VAR);

    table_header (dfplayer_header_cols, DFPLAYER_HEADER_COLS);

    sprintf (txtbuf, "Volume (0-%d)", DFPLAYER_MAX_VOLUME);
    sprintf (valbuf, "%d", volume);
    sprintf (maxbuf, "%d", DFPLAYER_MAX_VOLUME);
    table_row_slider (thispage, txtbuf, "volume", valbuf, "0", maxbuf);
    table_row_select (thispage, "Mode", "mode", dfplayer_mode_names, dfplayer_mode, 0, max_dfplayer_modes, 0);

    switch (dfplayer_mode)
    {
        case DFPLAYER_MODE_BELL:
        {
            begin_table_row_form (thispage);
            text_column ("Bell");
            http_send_FS ("<td>");
            checkbox_field ("m15", "xx:15", (bell_flags & DFPLAYER_MODE_BELL_FLAG_15) ? 1 : 0);
            checkbox_field ("m30", "xx:30", (bell_flags & DFPLAYER_MODE_BELL_FLAG_30) ? 1 : 0);
            checkbox_field ("m45", "xx:45", (bell_flags & DFPLAYER_MODE_BELL_FLAG_45) ? 1 : 0);
            http_send_FS ("</td>");
            save_column ("bell");
            end_table_row_form ();
            break;
        }
        case DFPLAYER_MODE_SPEAK:
        {
            table_row_input (thispage, 3, "Speak cycle", "speak", speak_cycle, 3);
            break;
        }
    }

    table_trailer ();

    table_header (dfplayer_silence_cols, DFPLAYER_SILENCE_COLS);

    begin_table_row_form (thispage);
    text_column ("Silence start");
    sprintf (hour_buf,   "%02d", silence_start / 60);
    sprintf (minute_buf, "%02d", silence_start % 60);
    input_column ("silstarth", "",  hour_buf, 2, 2);
    input_column ("silstartm", "",  minute_buf, 2, 2);
    save_column ("silstart");
    end_table_row_form ();

    begin_table_row_form (thispage);
    text_column ("Silence stop");
    sprintf (hour_buf,   "%02d", silence_stop / 60);
    sprintf (minute_buf, "%02d", silence_stop % 60);
    input_column ("silstoph", "",  hour_buf, 2, 2);
    input_column ("silstopm", "",  minute_buf, 2, 2);
    save_column ("silstop");
    end_table_row_form ();

    table_trailer ();

    table_header (alarm_header_cols, ALARM_TIMERS_HEADER_COLS);

    for (idx = 0; idx < MAX_ALARM_TIME_VARIABLES; idx++)
    {
        table_row_alarm_timers (thispage, idx);
    }

    table_trailer ();

    table_header (play_track_header_cols, PLAY_TRACK_HEADER_COLS);

    begin_table_row_form (thispage, 0);
    input_column ("plfolder", "",  "", 2, 2);
    input_column ("pltrack",  "",  "", 3, 3);
    button_column ("play", "Play");
    end_table_row_form ();

    table_trailer ();

    end_box ();
    http_trailer ();
    http_flush ();

    return rtc;
}

/*-------------------------------------------------------------------------------------------------------------------------------------------
 * tft page
 *-------------------------------------------------------------------------------------------------------------------------------------------
 */
#define SSD1963_GLOBAL_FLAGS_RGB_ORDER          0x01
#define SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL    0x02
#define SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL      0x04
#define SSD1963_GLOBAL_FLAGS_MASK               0x07

#define TFT_HEADER_COLS                         3

static uint_fast8_t
http_tft (void)
{
    const char *    thispage = "tft";
    const char *    tft_header_cols[TFT_HEADER_COLS]           = { "Name", "Value", "Action" };
    uint_fast8_t    flags;
    char *          action;
    uint_fast8_t    rtc = 0;

    flags = get_numvar (SSD1963_FLAGS_NUM_VAR);
    action = http_get_param ("action");

    if (action)
    {
        if (! strcmp (action, "saveflags"))
        {
            flags = 0;

            if (http_get_checkbox_param ("rgb"))
            {
                flags |= SSD1963_GLOBAL_FLAGS_RGB_ORDER;
            }
            
            if (http_get_checkbox_param ("hflip"))
            {
                flags |= SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL;
            }

            if (http_get_checkbox_param ("vflip"))
            {
                flags |= SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL;
            }

            set_numvar (SSD1963_FLAGS_NUM_VAR, flags);
        }
    }

    http_header ("TFT", (const char *) NULL, (const char *) NULL);
    begin_box ("TFT");

    table_header (tft_header_cols, TFT_HEADER_COLS);

    begin_table_row_form (thispage);
    text_column ("Color<BR>Hor.<BR>Vert.");
    http_send_FS ("<td align=right>");
    checkbox_field ("rgb", "RGB", (flags & SSD1963_GLOBAL_FLAGS_RGB_ORDER) ? 1 : 0);
    http_send_FS ("<br>");
    checkbox_field ("hflip", "Flip", (flags & SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL) ? 1 : 0);
    http_send_FS ("<br>");
    checkbox_field ("vflip", "Flip", (flags & SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL) ? 1 : 0);
    http_send_FS ("</td>");
    save_column ("flags");
    end_table_row_form ();

