granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
            httpclient_stop ();
            http_flush ();
        }
        else
        {
           Serial.print("Error in HTTP request: ");
           Serial.println(WC_LIST_TXT);
        }

        http_send_FS ("</select>\r\n");

        http_send_FS ("<button type=\"submit\" name=\"action\" value=\"dwntable\">Download layout table</button>"
                      "</form>"
                      "<P>\r\n");
    }

    http_send_FS ("<table style=\"width:auto\">");

    if (fname_icon)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_icon);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-icon' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>&nbsp;"
                "<input type='submit' class='button' name='submit' value='Upload'>"
                "</form></td></tr>"
                );
    }

    if (fname_weather)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_weather);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-icon-weather' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>&nbsp;"
                "<input type='submit' class='button' name='submit' value='Upload'>"
                "</form></td></tr>"
                );
    }

    if (fname_tables)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_tables);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-tables' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>&nbsp;"
                "<input type='submit' class='button' name='submit' value='Upload'>"
                "</form></td></tr>"
                );
    }

    if (hardware_configuration != 0xFFFF && (hardware_configuration & HW_LED_MASK) == HW_LED_TFTLED_RGB_LED && fname_display)
    {
        http_send_FS ("<tr><td>");
        http_send (fname_display);
        http_send_FS ("</td><td>"
                "<form method='post' action='fs-display' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
                "<label class='custom-file-upload'><input type='file' name='fileField'>File...</label>&nbsp;"
                "<input type='submit' class='button' name='submit' value='Upload'>"
                "</form></td></tr>"
                );
    }

    http_send_FS ("</table><P>\r\n");

    http_send_FS ("<B>WordClock App bundle (/app)</B><BR>\r\n");
    http_send_FS ("Use app-bundle.txt for a single OTA upload, or download it directly from the configured update server above. Installed files appear as app-index.html, app-app.js, app-styles.css, app-manifest.webmanifest, app-sw.js and app-icons-*.svg in LittleFS.<P>\r\n");

    if (app_bundle_available)
    {
        http_send_FS (
                      "<form method=\"GET\" action=\"/fs\" style=\"display:inline\">"
                      "<button type=\"submit\" name=\"action\" value=\"dwnappbundle\">Download WordClock App bundle</button>"
                      "</form>"
                      "<P>\r\n");
    }

    http_send_FS ("<table style=\"width:auto\">");
    http_send_FS ("<tr><td>app-bundle.txt</td><td>"
            "<form method='post' action='fs-app-bundle' name='submit' enctype='multipart/form-data' style=\"display:inline\">"
            "<label class='custom-file-upload'><input type='file' name='fileField'>Bundle...</label>&nbsp;"
            "<input type='submit' class='button' name='submit' value='Install App'>"
            "</form></td></tr>"
            );

    http_send_FS ("</table>");

    if (show_fname)
    {
        LittleFS.begin ();
        File fp = LittleFS.open(show_fname, "r");

        if (fp)
        {
            char  b[2];
            int   ch;

            b[1] = '\0';

            http_send (show_fname);
            http_send_FS (":<BR><pre>\r\n");

            while ((ch = fp.read ()) >= 0)
            {
                if (ch == '\r')
                {
                    http_send_FS ("&lt;CR&gt;");
                }
                else if (ch == '\n')
                {
                    http_send_FS ("&lt;LF&gt;\n");
                }
                else
                {
                    b[0] = ch;
                    http_send (b);
                }
            }

            fp.close ();
            http_send_FS ("</pre>\r\n");
        }
        LittleFS.end ();
    }
    end_box ();
    http_trailer ();
    http_flush ();
    return rtc;
}

static const char *
http_get_fs_upload_filename (uint_fast8_t post)
{
    uint_fast16_t led;

    if (hardware_configuration == 0xFFFF)
    {
        return (const char *) 0;
    }

    led = hardware_configuration & HW_LED_MASK;

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H:
            switch (post)
            {
                case POST_ICON_FILE:         return "wc24h-icon.txt";
                case POST_ICON_WEATHER_FILE: return "wc24h-weather.txt";
                case POST_TABLES_FILE:       return "wc24h-tables-local.txt";
                case POST_DISPLAY_FILE:      return led == HW_LED_TFTLED_RGB_LED ? "wc24h-display-local.txt" : (const char *) 0;
            }
            break;

        case HW_WC_12H:
            switch (post)
            {
                case POST_ICON_FILE:         return "wc12h-icon.txt";
                case POST_ICON_WEATHER_FILE: return "wc12h-weather.txt";
                case POST_TABLES_FILE:       return "wc12h-tables-local.txt";
                case POST_DISPLAY_FILE:      return led == HW_LED_TFTLED_RGB_LED ? "wc12h-display-local.txt" : (const char *) 0;
            }
            break;

        case HW_UCLOCK:
            switch (post)
            {
                case POST_ICON_FILE:         return "uc-icon.txt";
                case POST_ICON_WEATHER_FILE: return "uc-weather.txt";
            }
            break;
    }

    return (const char *) 0;
}

static uint_fast8_t
http_api_fs_upload (uint_fast8_t post)
{
    const char *    filename = http_get_fs_upload_filename (post);
    const char *    target_filename = filename;
    size_t          content_length = 0;
    uint_fast8_t    ok = 0;
    uint32_t        error_code = 0;
    char *          uploaded_name = http_get_param ("filename");

    if (! filename)
    {
        error_code = 1;
    }
    else if ((post == POST_TABLES_FILE && ! http_tables_filename_matches (uploaded_name, filename)) ||
             (post != POST_TABLES_FILE && ! http_filename_matches (uploaded_name, filename)))
    {
        error_code = 5;
    }
    else if (! read_post_headers (&content_length) || content_length == 0)
    {
        error_code = 2;
    }
    else
    {
        LittleFS.begin ();

        if (post == POST_TABLES_FILE)
        {
            target_filename = uploaded_name;
            http_remove_table_family_files (target_filename);
        }

        File f = LittleFS.open (target_filename, "w+");

        if (! f)
        {
            error_code = 3;
        }
        else
        {
            ok = read_request_body_to_file (f, content_length) ? 1 : 0;
            f.close ();

            if (! ok)
            {
                LittleFS.remove (target_filename);
                error_code = 4;
            }
            else if (post == POST_TABLES_FILE)
            {
                tables_init ();
            }
        }

