granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
                        if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
                        {
                            fname[l++] = ch;
                        }
                        else if (ch == '\n')
                        {
                            int show_option;

                            fname[l] = '\0';
                            l = 0;

                            show_option = 1;

                            if (filter)
                            {
                                if (strncmp (fname + 6, filter, strlen (filter)) != 0)
                                {
                                    show_option = 0;
                                }
                            }

                            if (show_option)
                            {
                                http_send_FS ("<option value=\"");
                                http_send (fname);
        
                                if (! strcmp (fname, stm32_default_filename))
                                {
                                    http_send_FS ("\" selected>");
                                }
                                else
                                {
                                    http_send_FS ("\">");
                                }
        
                                http_send (fname);
                                http_send_FS ("</option>\r\n");
                            }
                        }
                    }
    
                    httpclient_stop ();
                    http_flush ();
                }
                else
                {
                   Serial.print("Error in HTTP request: ");
                   Serial.println(WC_LIST_TXT);
                }
                http_send_FS ("</select>\r\n");
    
                http_send_FS ("<button type=\"submit\" name=\"action\" value=\"flash\">Flash STM32</button>"
                              "</form>"
                              "<P>\r\n");
            }

            end_box ();
            http_trailer ();
            http_flush ();
        }
    }
    else
    {
        http_send_FS ("<font color=red><B>Flash size of ESP8266 is too small for Update over OTA</B></font><BR>\r\n");
        end_box ();
        http_trailer ();
        http_flush ();
    }

    return rtc;
}

String
sanitize_xml_string(const String& str)
{
    String result;
    for (unsigned int i = 0; i < str.length(); i++)
    {
        switch (str[i])
        {
        case '&':
            result += "&amp;";
            break;
        case '<':
            result += "&lt;";
            break;
        case '>':
            result += "&gt;";
            break;
        default:
            result += str[i];
            break;
        }
    }
    return result;
}

String
sanitize_json_string (const String& str)
{
    String result;

    for (unsigned int i = 0; i < str.length (); i++)
    {
        switch (str[i])
        {
            case '\\':
                result += "\\\\";
                break;
            case '"':
                result += "\\\"";
                break;
            case '\r':
                result += "\\r";
                break;
            case '\n':
                result += "\\n";
                break;
            case '\t':
                result += "\\t";
                break;
            default:
                result += str[i];
                break;
        }
    }

    return result;
}

static void
http_fetch_remote_line (const char * host, const char * path, const char * filename, char * buffer, size_t buffer_len)
{
    int len;
    int l = 0;

    if (buffer_len == 0)
    {
        return;
    }

    buffer[0] = '\0';
    len = httpclient (host, path, filename);

    if (len > 0)
    {
        int ch;

        while (len > 0)
        {
            ch = httpclient_read (&len);

            if (ch != '\r' && ch != '\n' && l < (int) buffer_len - 1)
            {
                buffer[l++] = ch;
            }
        }

        httpclient_stop ();
    }

    buffer[l] = '\0';
}

static String
http_fetch_remote_text (const char * host, const char * path, const char * filename, size_t max_len)
{
    int len;
    String result;

    len = httpclient (host, path, filename);

    if (len > 0)
    {
        int ch;

        while (len > 0 && result.length () < max_len)
        {
            ch = httpclient_read (&len);

            if (ch >= 0)
            {
                result += (char) ch;
            }
        }

        httpclient_stop ();
    }

    return result;
}

static void
http_build_stm32_default_filename (char * stm32_default_filename, size_t max_len, const char ** filter)
{
    stm32_default_filename[0] = '\0';
    *filter = (const char *) NULL;

    if (hardware_configuration == 0xFFFF || max_len == 0)
    {
        return;
    }

    switch (hardware_configuration & HW_WC_MASK)
    {
        case HW_WC_24H:                       strcat (stm32_default_filename, "wc24h-");          break;
        case HW_WC_12H:                       strcat (stm32_default_filename, "wc12h-");          break;
        case HW_UCLOCK:                       strcat (stm32_default_filename, "uc-");             break;
    }

    switch (hardware_configuration & HW_STM32_MASK)
    {
        case HW_STM32_F103C8:                 strcat (stm32_default_filename, "stm32f103-");        *filter = "stm32f103-"; break;
        case HW_STM32_F401RE:                 strcat (stm32_default_filename, "stm32f401-");        *filter = "stm32f401-"; break;
        case HW_STM32_F411RE:                 strcat (stm32_default_filename, "stm32f411-");        *filter = "stm32f411-"; break;
        case HW_STM32_F446RE:                 strcat (stm32_default_filename, "stm32f446-");        *filter = "stm32f446-"; break;
        case HW_STM32_F407VE:                 strcat (stm32_default_filename, "stm32f407-");        *filter = "stm32f407-"; break;
        case HW_STM32_F401CC:
        {
            switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
            {
                case HW_OSC_FREQUENCY_8MHZ:   strcat (stm32_default_filename, "stm32f401cc-8-");    *filter = "stm32f401cc-8-"; break;
                case HW_OSC_FREQUENCY_25MHZ:  strcat (stm32_default_filename, "stm32f401cc-25-");   *filter = "stm32f401cc-25-"; break;
            }
            break;
        }
        case HW_STM32_F411CE:
        {
            switch (hardware_configuration & HW_OSC_FREQUENCY_MASK)
            {
                case HW_OSC_FREQUENCY_8MHZ:   strcat (stm32_default_filename, "stm32f411ce-8-");    *filter = "stm32f411ce-8-"; break;
                case HW_OSC_FREQUENCY_25MHZ:  strcat (stm32_default_filename, "stm32f411ce-25-");   *filter = "stm32f411ce-25-"; break;
            }
            break;
        }
    }

    switch (hardware_configuration & HW_LED_MASK)
    {
        case HW_LED_WS2812_GRB_LED:     strcat (stm32_default_filename, "ws2812-grb.hex");  break;
        case HW_LED_WS2812_RGB_LED:     strcat (stm32_default_filename, "ws2812-rgb.hex");  break;
        case HW_LED_APA102_RGB_LED:     strcat (stm32_default_filename, "apa102-grb.hex");  break;
        case HW_LED_SK6812_RGB_LED:     strcat (stm32_default_filename, "sk6812-rgb.hex");  break;
        case HW_LED_SK6812_RGBW_LED:    strcat (stm32_default_filename, "sk6812-rgbw.hex"); break;
        case HW_LED_TFTLED_RGB_LED:     strcat (stm32_default_filename, "tftled-rgb.hex");  break;
    }
}

static int
http_send_settings_xml (const char * header)
{
    char          buff[255];
    int           i;
    uint_fast8_t  ui;
    TM *          tm;

    http_send(header ? header : FS("HTTP/1.0 200 OK\r\n\r\n"));
    http_send(FS("<settings>"));

    // num vars
    for (i = 0; i < MAX_NUM_VARIABLES; i++)
    {
        sprintf(buff, FS("<numvar idx=\"%d\" value=\"%d\" />"), i, numvars[i]);
        http_send(buff);
    }

    // string vars
    for (i = 0; i < MAX_STR_VARIABLES; i++)
    {
        sprintf(buff, FS("<strvar idx=\"%d\" value=\"%s\" />"), i, sanitize_xml_string(strvars[i].str).c_str());
        http_send(buff);
    }

    // tm vars
    for (i = 0; i < MAX_TM_VARIABLES; i++)
    {
        tm = get_tm_var ((TM_VARIABLE) i);

