granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
        LittleFS.end ();
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");

    if (! ok)
    {
        http_send (FS(",\"error\":"));
        http_send (String (error_code).c_str ());
        http_send (FS(",\"detail\":\""));

        switch (error_code)
        {
            case 1: http_send (FS("invalid request")); break;
            case 2: http_send (FS("open failed")); break;
            case 3: http_send (FS("upload failed")); break;
            case 4: http_send (FS("install failed")); break;
            case 5: http_send (FS("invalid filename")); break;
            default: http_send (FS("unknown error")); break;
        }

        http_send (FS("\""));
    }

    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_maintenance_format_fs ()
{
    LittleFS.begin ();
    LittleFS.format ();
    LittleFS.end ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_maintenance_reset_stm32 ()
{
    update_progress_state ("reset", "STM32 wird zurückgesetzt.");
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();
    delay (200);
    stm32_reset ();
    update_progress_complete ("STM32 wurde zurückgesetzt.");

    return 0;
}

static int
http_api_maintenance_reset_eeprom ()
{
    rpc (RESET_EEPROM_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_datetime_set ()
{
    TM  tm;
    int year = atoi (http_get_param ("year"));
    int month = atoi (http_get_param ("month"));
    int day = atoi (http_get_param ("day"));
    int hour = atoi (http_get_param ("hour"));
    int minute = atoi (http_get_param ("minute"));

    if (year < 2000)
    {
        year = 2000;
    }
    else if (year > 2999)
    {
        year = 2999;
    }

    if (month < 1)
    {
        month = 1;
    }
    else if (month > 12)
    {
        month = 12;
    }

    if (day < 1)
    {
        day = 1;
    }
    else if (day > 31)
    {
        day = 31;
    }

    if (hour < 0)
    {
        hour = 0;
    }
    else if (hour > 23)
    {
        hour = 23;
    }

    if (minute < 0)
    {
        minute = 0;
    }
    else if (minute > 59)
    {
        minute = 59;
    }

    tm.tm_year = year - 1900;
    tm.tm_mon = month - 1;
    tm.tm_mday = day;
    tm.tm_hour = hour;
    tm.tm_min = minute;
    tm.tm_sec = 0;
    tm.tm_wday = dayofweek (day, month, year);

    set_tm_var (CURRENT_TM_VAR, &tm);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_learn_ir ()
{
    rpc (LEARN_IR_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_display ()
{
    rpc (DISPLAY_TEMPERATURE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_rtc_correction_set ()
{
    uint_fast8_t temp_index = get_numvar (RTC_TEMP_INDEX_NUM_VAR);
    uint_fast8_t old_correction = get_numvar (RTC_TEMP_CORRECTION_NUM_VAR);
    int temp_corr = atoi (http_get_param ("value"));

    if (temp_corr < 0)
    {
        temp_corr = -temp_corr;
    }

    if (old_correction > temp_corr)
    {
        temp_index += (old_correction - temp_corr);
    }
    else
    {
        temp_index -= (temp_corr - old_correction);
    }

    numvars[RTC_TEMP_INDEX_NUM_VAR] = temp_index;
    set_numvar (RTC_TEMP_CORRECTION_NUM_VAR, temp_corr);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_temperature_ds18xx_correction_set ()
{
    uint_fast8_t temp_index = get_numvar (DS18XX_TEMP_INDEX_NUM_VAR);
    uint_fast8_t old_correction = get_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR);
    int temp_corr = atoi (http_get_param ("value"));

    if (temp_corr < 0)
    {
        temp_corr = -temp_corr;
    }

    if (old_correction > temp_corr)
    {
        temp_index += (old_correction - temp_corr);
    }
    else
    {
        temp_index -= (temp_corr - old_correction);
    }

    numvars[DS18XX_TEMP_INDEX_NUM_VAR] = temp_index;
    set_numvar (DS18XX_TEMP_CORRECTION_NUM_VAR, temp_corr);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_min_set ()
{
    rpc (LDR_MIN_VALUE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_min_value_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }

    set_numvar (LDR_MIN_VALUE_NUM_VAR, value);
    http_json_ok ();

    return 0;
}

static int
http_api_ldr_max_set ()
{
    rpc (LDR_MAX_VALUE_RPC_VAR);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ldr_max_value_set ()
{
    int value = atoi (http_get_param ("value"));

