granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (value < 0)
    {
        value = 0;
    }

    set_numvar (LDR_MAX_VALUE_NUM_VAR, value);
    http_json_ok ();

    return 0;
}

static int
http_api_animation_mode_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }
    else if (value >= max_display_animation_variables)
    {
        value = max_display_animation_variables ? max_display_animation_variables - 1 : 0;
    }

    set_numvar (ANIMATION_MODE_NUM_VAR, value);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_color_animation_mode_set ()
{
    int value = atoi (http_get_param ("value"));

    if (value < 0)
    {
        value = 0;
    }
    else if (value >= MAX_COLOR_ANIMATION_VARIABLES)
    {
        value = MAX_COLOR_ANIMATION_VARIABLES - 1;
    }

    set_numvar (COLOR_ANIMATION_MODE_NUM_VAR, value);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_animation_profile_set ()
{
    uint_fast8_t idx = atoi (http_get_param ("idx"));
    uint_fast8_t deceleration = atoi (http_get_param ("deceleration"));
    uint_fast8_t favourite = 0;

    if (idx < max_display_animation_variables)
    {
        DISPLAY_ANIMATION * da = get_display_animation_var (idx);

        if (deceleration >= ANIMATION_MIN_DECELERATION && deceleration <= ANIMATION_MAX_DECELERATION)
        {
            set_display_animation_deceleration (idx, deceleration);
        }

        favourite = (http_get_param ("favourite") && ! strcmp (http_get_param ("favourite"), "on")) ? 1 : 0;

        if (favourite)
        {
            set_display_animation_flags (idx, da->flags | ANIMATION_FLAG_FAVOURITE);
        }
        else
        {
            set_display_animation_flags (idx, da->flags & ~ANIMATION_FLAG_FAVOURITE);
        }
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_animation_profile_default ()
{
    uint_fast8_t idx = atoi (http_get_param ("idx"));

    if (idx < max_display_animation_variables)
    {
        DISPLAY_ANIMATION * da = get_display_animation_var (idx);
        set_display_animation_deceleration (idx, da->default_deceleration);
        set_display_animation_flags (idx, da->flags | ANIMATION_FLAG_FAVOURITE);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_color_animation_profile_set ()
{
    uint_fast8_t idx = atoi (http_get_param ("idx"));
    uint_fast8_t deceleration = atoi (http_get_param ("deceleration"));

    if (idx < MAX_COLOR_ANIMATION_VARIABLES && deceleration <= COLOR_ANIMATION_MAX_DECELERATION)
    {
        set_color_animation_deceleration ((COLOR_ANIMATION_VARIABLE) idx, deceleration);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_color_animation_profile_default ()
{
    COLOR_ANIMATION_VARIABLE idx = (COLOR_ANIMATION_VARIABLE) atoi (http_get_param ("idx"));

    if (idx < MAX_COLOR_ANIMATION_VARIABLES)
    {
        COLOR_ANIMATION * ca = get_color_animation_var (idx);
        set_color_animation_deceleration (idx, ca->default_deceleration);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_display_dim_level_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int value = atoi (http_get_param ("value"));

    if (idx >= 0 && idx <= MAX_BRIGHTNESS)
    {
        if (value < 0)
        {
            value = 0;
        }
        else if (value > 15)
        {
            value = 15;
        }

        set_num8_array (DISPLAY_DIMMED_DISPLAY_COLORS, idx, value);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_dim_level_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int value = atoi (http_get_param ("value"));

    if (idx >= 0 && idx <= MAX_BRIGHTNESS)
    {
        if (value < 0)
        {
            value = 0;
        }
        else if (value > 15)
        {
            value = 15;
        }

        set_num8_array (DISPLAY_DIMMED_AMBILIGHT_COLORS, idx, value);
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_tft_flags_set ()
{
    uint_fast8_t flags = 0;

    if (http_get_param ("rgb") && ! strcmp (http_get_param ("rgb"), "on"))
    {
        flags |= SSD1963_GLOBAL_FLAGS_RGB_ORDER;
    }

    if (http_get_param ("hflip") && ! strcmp (http_get_param ("hflip"), "on"))
    {
        flags |= SSD1963_GLOBAL_FLAGS_FLIP_HORIZONTAL;
    }

    if (http_get_param ("vflip") && ! strcmp (http_get_param ("vflip"), "on"))
    {
        flags |= SSD1963_GLOBAL_FLAGS_FLIP_VERTICAL;
    }

    set_numvar (SSD1963_FLAGS_NUM_VAR, flags);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();

    return 0;
}

static int
http_api_display_use_rgbw_set ()
{
    uint_fast8_t use_rgbw = http_get_on_off_value ("value", get_numvar (DISPLAY_USE_RGBW_NUM_VAR));

    set_numvar (DISPLAY_USE_RGBW_NUM_VAR, use_rgbw ? 1 : 0);
    http_json_ok ();

