granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_ambilight_brightness_set ()
{
    char * value = http_get_param ("value");
    int    brightness = atoi (value ? value : "0");

    if (brightness < 0)
    {
        brightness = 0;
    }
    else if (brightness > 15)
    {
        brightness = 15;
    }

    set_numvar (AMBILIGHT_BRIGHTNESS_NUM_VAR, brightness);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_brightness\":"));
    char buf[8];
    sprintf (buf, "%d", brightness);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_mode_set ()
{
    char * value = http_get_param ("value");
    int    mode = atoi (value ? value : "0");

    if (mode < 0)
    {
        mode = 0;
    }
    else if (mode >= MAX_AMBILIGHT_MODE_VARIABLES)
    {
        mode = MAX_AMBILIGHT_MODE_VARIABLES - 1;
    }

    set_numvar (AMBILIGHT_MODE_NUM_VAR, mode);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_mode\":"));
    char buf[8];
    sprintf (buf, "%d", mode);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_leds_set ()
{
    char * value = http_get_param ("value");
    int    leds = atoi (value ? value : "0");

    if (leds < 0)
    {
        leds = 0;
    }
    else if (leds > 999)
    {
        leds = 999;
    }

    set_numvar (AMBILIGHT_LEDS_NUM_VAR, leds);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_leds\":"));
    char buf[8];
    sprintf (buf, "%d", leds);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_offset_set ()
{
    char * value = http_get_param ("value");
    int    offset = atoi (value ? value : "0");

    if (offset < 0)
    {
        offset = 0;
    }
    else if (offset > 999)
    {
        offset = 999;
    }

    set_numvar (AMBILIGHT_OFFSET_NUM_VAR, offset);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"ambilight_offset\":"));
    char buf[8];
    sprintf (buf, "%d", offset);
    http_send (buf);
    http_send (FS("}"));
    http_flush ();

    return 0;
}

static int
http_api_ambilight_mode_profile_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int deceleration = atoi (http_get_param ("deceleration"));

    if (idx >= 0 && idx < MAX_AMBILIGHT_MODE_VARIABLES)
    {
        if (deceleration < 0)
        {
            deceleration = 0;
        }
        else if (deceleration > AMBILIGHT_MODE_MAX_DECELERATION)
        {
            deceleration = AMBILIGHT_MODE_MAX_DECELERATION;
        }

        set_ambilight_mode_deceleration ((AMBILIGHT_MODE_VARIABLE) idx, deceleration);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_ambilight_mode_profile_default ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_AMBILIGHT_MODE_VARIABLES)
    {
        AMBILIGHT_MODE * am = get_ambilight_mode_var ((AMBILIGHT_MODE_VARIABLE) idx);

        if (am)
        {
            set_ambilight_mode_deceleration ((AMBILIGHT_MODE_VARIABLE) idx, am->default_deceleration);
        }
    }

    http_json_ok ();

    return 0;
}

static void
http_json_ok ()
{
    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true}"));
    http_flush ();
}

static uint_fast8_t
http_get_on_off_value (const char * param, uint_fast8_t current_value)
{
    char * value = http_get_param (param);

    if (value && ! strcmp (value, "on"))
    {
        return 1;
    }
    else if (value && ! strcmp (value, "off"))
    {
        return 0;
    }

    return current_value;
}

static uint_fast8_t
http_get_color_component (const char * param)
{
    char * value = http_get_param (param);
    int    component = atoi (value ? value : "0");

    if (component < 0)
    {
        component = 0;
    }
    else if (component > 63)
    {
        component = 63;
    }

    return component;
}

static int
http_api_set_dsp_color (DSP_COLOR_VARIABLE var)
{
    DSP_COLORS   rgbw;
    uint_fast8_t use_rgbw = get_numvar (DISPLAY_USE_RGBW_NUM_VAR);

    rgbw.red     = http_get_color_component ("red");
    rgbw.green   = http_get_color_component ("green");
    rgbw.blue    = http_get_color_component ("blue");
    rgbw.white   = use_rgbw ? http_get_color_component ("white") : 0;

    set_dsp_color_var (var, &rgbw, use_rgbw);
    http_json_ok ();

    return 0;
}

static int
http_api_display_color_set ()
{
    return http_api_set_dsp_color (DISPLAY_DSP_COLOR_VAR);
}

static int
http_api_ambilight_color_set ()
{
    return http_api_set_dsp_color (AMBILIGHT_DSP_COLOR_VAR);
}

static int
http_api_marker_color_set ()
{
    return http_api_set_dsp_color (AMBILIGHT_MARKER_DSP_COLOR_VAR);
}

static int
http_api_live_display_color ()
{
    DSP_COLORS rgbw;
    char       buf[160];

    get_dsp_color_var (DISPLAY_DSP_COLOR_VAR, &rgbw);

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    sprintf (buf,
             FS("{\"ok\":true,\"red\":%d,\"green\":%d,\"blue\":%d,\"white\":%d}"),
             rgbw.red,
             rgbw.green,
             rgbw.blue,
             rgbw.white);
    http_send (buf);
    http_flush ();

    return 0;
}

static int
http_api_sync_ambilight_set ()
{
    uint_fast8_t flags = get_numvar (DISPLAY_FLAGS_NUM_VAR);

    if (http_get_on_off_value ("value", flags & DISPLAY_FLAGS_SYNC_AMBILIGHT))
    {
        flags |= DISPLAY_FLAGS_SYNC_AMBILIGHT;
    }
    else
    {
        flags &= ~DISPLAY_FLAGS_SYNC_AMBILIGHT;
    }

    set_numvar (DISPLAY_FLAGS_NUM_VAR, flags);
    http_json_ok ();

