granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    return 0;
}

static int
http_api_overlay_set ()
{
    int idx = atoi (http_get_param ("idx"));
    int n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);

    if (idx >= 0 && idx < MAX_OVERLAYS)
    {
        if (idx == n_overlays && n_overlays < MAX_OVERLAYS)
        {
            n_overlays++;
            set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays);
        }

        if (idx < n_overlays)
        {
            uint_fast8_t val;
            uint_fast8_t valmm;
            uint_fast8_t valdd;
            char * text;

            if (http_get_on_off_value ("active", 0))
            {
                overlays[idx].flags |= OVERLAY_FLAG_ACTIVE;
            }
            else
            {
                overlays[idx].flags &= ~OVERLAY_FLAG_ACTIVE;
            }

            overlays[idx].type = atoi (http_get_param ("type"));
            val = atoi (http_get_param ("interval"));

            if (val == 0)
            {
                val = 5;
            }

            overlays[idx].interval = val;

            val = atoi (http_get_param ("duration"));

            if (val < 5)
            {
                val = 5;
            }
            else if (val > 9)
            {
                val = 9;
            }

            overlays[idx].duration = val;
            overlays[idx].date_code = atoi (http_get_param ("date_code"));

            valmm = atoi (http_get_param ("month"));
            valdd = atoi (http_get_param ("day"));

            if (valmm < 1 || valmm > 12 || valdd < 1 || valdd > 31)
            {
                overlays[idx].date_start = 0;
            }
            else
            {
                overlays[idx].date_start  = (valmm << 8) | valdd;
            }

            val = atoi (http_get_param ("days"));

            if (val < 1)
            {
                val = 1;
            }

            overlays[idx].days = val;

            text = http_get_param ("value");

            if (text)
            {
                strncpy (overlays[idx].text, text, OVERLAY_MAX_TEXT_LEN);
                overlays[idx].text[OVERLAY_MAX_TEXT_LEN] = '\0';
            }

            set_overlay_var (idx);
        }
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_display ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR))
    {
        set_numvar (DISPLAY_OVERLAY_NUM_VAR, idx);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_delete ()
{
    int idx = atoi (http_get_param ("idx"));
    int n_overlays = get_numvar (OVERLAY_N_OVERLAYS_NUM_VAR);
    int i;

    if (idx >= 0 && idx < n_overlays)
    {
        for (i = idx; i < n_overlays - 1; i++)
        {
            overlays[i] = overlays[i + 1];
            set_overlay_var (i);
        }

        if (n_overlays > 0)
        {
            memset (&overlays[n_overlays - 1], 0, sizeof (OVERLAY));
            set_overlay_var (n_overlays - 1);
            set_numvar (OVERLAY_N_OVERLAYS_NUM_VAR, n_overlays - 1);
        }
    }

    http_json_ok ();

    return 0;
}

static int
http_api_timer_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_NIGHT_TIME_VARIABLES)
    {
        uint_fast8_t flags = 0;
        uint_fast8_t from_day = atoi (http_get_param ("from"));
        uint_fast8_t to_day = atoi (http_get_param ("to"));
        uint_fast16_t minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));

        if (http_get_on_off_value ("active", 0))
        {
            flags |= NIGHT_TIME_FLAG_ACTIVE;
        }

        if (http_get_on_off_value ("switch_on", 0))
        {
            flags |= NIGHT_TIME_FLAG_SWITCH_ON;
        }

        flags |= NIGHT_TIME_FROM_DAY_MASK & (from_day << 3);
        flags |= NIGHT_TIME_TO_DAY_MASK & to_day;

        set_night_time_var (0, (NIGHT_TIME_VARIABLE) idx, minutes, flags);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_ambilight_timer_set ()
{
    int idx = atoi (http_get_param ("idx"));

    if (idx >= 0 && idx < MAX_NIGHT_TIME_VARIABLES)
    {
        uint_fast8_t flags = 0;
        uint_fast8_t from_day = atoi (http_get_param ("from"));
        uint_fast8_t to_day = atoi (http_get_param ("to"));
        uint_fast16_t minutes = atoi (http_get_param ("hour")) * 60 + atoi (http_get_param ("minute"));

        if (http_get_on_off_value ("active", 0))
        {
            flags |= NIGHT_TIME_FLAG_ACTIVE;
        }

        if (http_get_on_off_value ("switch_on", 0))
        {
            flags |= NIGHT_TIME_FLAG_SWITCH_ON;
        }

        flags |= NIGHT_TIME_FROM_DAY_MASK & (from_day << 3);
        flags |= NIGHT_TIME_TO_DAY_MASK & to_day;

        set_night_time_var (1, (NIGHT_TIME_VARIABLE) idx, minutes, flags);
    }

    http_json_ok ();

    return 0;
}

static int
http_api_overlay_icons ()
{
    static const char * const icon_candidates[] = { "wc24h-icon.txt", "wc12h-icon.txt", "uc-icon.txt" };
    const char *  fname = (const char *) 0;

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("["));

    LittleFS.begin ();
    fname = http_find_existing_filename (http_get_configured_icon_filename (), icon_candidates, sizeof (icon_candidates) / sizeof (icon_candidates[0]));

    if (fname)
    {
        File fp = LittleFS.open (fname, "r");

        if (fp)
        {
            int   ch = fp.read ();
            int   first = 1;
            char  icon_name[32 + 1];

            while (ch == '*')
            {
                int i = 0;

                while ((ch = fp.read ()) != EOF)
                {
                    if (ch == '\r' || ch == '\n')
                    {
                        break;
                    }

                    if (i < 32)
                    {
                        icon_name[i++] = ch;
                    }
                }

                icon_name[i] = '\0';
                trim (icon_name);

                if (! first)
                {
                    http_send (FS(","));
                }

                http_send (FS("\""));
                http_send (sanitize_json_string(icon_name).c_str());
                http_send (FS("\""));
                first = 0;

                while ((ch = fp.read()) != '*' && ch >= 0)
                {
                    ;
                }
            }

            fp.close ();
        }
    }

