granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    LittleFS.end ();

    http_send (FS("]"));
    http_flush ();

    return 0;
}

static int
http_api_fs_info ()
{
    FSInfo fsinfo;

    LittleFS.begin ();

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));

    if (LittleFS.info (fsinfo))
    {
        char buf[16];

        http_send (FS("{\"ok\":true"));

        sprintf (buf, "%d", fsinfo.totalBytes);
        http_send (FS(",\"total\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.usedBytes);
        http_send (FS(",\"used\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.blockSize);
        http_send (FS(",\"block_size\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.pageSize);
        http_send (FS(",\"page_size\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.maxOpenFiles);
        http_send (FS(",\"max_open_files\":"));
        http_send (buf);

        sprintf (buf, "%d", fsinfo.maxPathLength);
        http_send (FS(",\"max_path_length\":"));
        http_send (buf);

        http_send (FS("}"));
    }
    else
    {
        http_send (FS("{\"ok\":false}"));
    }

    LittleFS.end ();
    http_flush ();

    return 0;
}

static int
http_api_fs_list ()
{
    Dir dir;
    int first = 1;

    LittleFS.begin ();
    dir = LittleFS.openDir ("");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"files\":["));

    while (dir.next ())
    {
        File f = dir.openFile ("r");
        char sizebuf[16];

        if (! first)
        {
            http_send (FS(","));
        }

        sprintf (sizebuf, "%d", f ? f.size () : 0);
        http_send (FS("{\"name\":\""));
        http_send (sanitize_json_string (dir.fileName ()).c_str ());
        http_send (FS("\",\"size\":"));
        http_send (sizebuf);
        http_send (FS("}"));

        if (f)
        {
            f.close ();
        }

        first = 0;
    }

    LittleFS.end ();

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static int
http_api_fs_show ()
{
    char * fname = http_get_param ("filename");

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: text/plain; charset=utf-8\r\nCache-Control: no-cache\r\n\r\n"));

    if (fname && *fname)
    {
        LittleFS.begin ();
        File fp = LittleFS.open (fname, "r");

        if (fp)
        {
            while (fp.available ())
            {
                char b[64];
                int n = fp.readBytes (b, sizeof (b));

                if (n > 0)
                {
                    for (int i = 0; i < n; i++)
                    {
                        char cbuf[2];
                        cbuf[0] = b[i];
                        cbuf[1] = '\0';
                        http_send (cbuf);
                    }
                }
            }

            fp.close ();
        }

        LittleFS.end ();
    }

    http_flush ();

    return 0;
}

static int
http_api_fs_remove ()
{
    char * fname = http_get_param ("filename");

    if (fname && *fname)
    {
        LittleFS.begin ();
        LittleFS.remove (fname);
        LittleFS.end ();
    }

    http_json_ok ();

    return 0;
}

static int
http_api_update_status ()
{
    STR_VAR * sv;
    char * update_host;
    char * update_path;
    uint32_t flashsize;
    char new_esp_version[16];
    char new_app_version[16];
    char new_wc_version[16];
    char stm32_default_filename[MAX_UPDATE_FILENAME_LEN];
    const char * filter = (const char *) NULL;
    String release_notes;
    uint_fast8_t assets_available = 0;
    uint_fast8_t app_bundle_available = 0;
    const char * fname_icon = (const char *) 0;
    const char * fname_weather = (const char *) 0;
    int len;
    int first = 1;

    sv = get_strvar (UPDATE_HOST_VAR);
    update_host = sv->str;

    if (! update_host[0])
    {
        update_host = (char *) DEFAULT_UPDATE_HOST;
    }

    sv = get_strvar (UPDATE_PATH_VAR);
    update_path = sv->str;

    if (! update_path[0])
    {
        update_path = (char *) DEFAULT_UPDATE_PATH;
    }

    flashsize = ESP.getFlashChipRealSize ();
    http_fetch_remote_line (update_host, update_path, ESP_WORDCLOCK_TXT, new_esp_version, sizeof (new_esp_version));
    http_fetch_remote_line (update_host, update_path, APP_VERSION_TXT, new_app_version, sizeof (new_app_version));
    http_fetch_remote_line (update_host, update_path, WC_TXT, new_wc_version, sizeof (new_wc_version));
    release_notes = http_fetch_remote_text (update_host, update_path, RELEASENOTE_HTML, 3072);
    http_build_stm32_default_filename (stm32_default_filename, sizeof (stm32_default_filename), &filter);

    if (hardware_configuration != 0xFFFF)
    {
        switch (hardware_configuration & HW_WC_MASK)
        {
            case HW_WC_24H:
                fname_icon = "wc24h-icon.txt";
                fname_weather = "wc24h-weather.txt";
                break;
            case HW_WC_12H:
                fname_icon = "wc12h-icon.txt";
                fname_weather = "wc12h-weather.txt";
                break;
            case HW_UCLOCK:
                fname_icon = "uc-icon.txt";
                fname_weather = "uc-weather.txt";
                break;
        }
    }

    if (fname_icon && fname_weather)
    {
        int len_icon = httpclient (update_host, update_path, fname_icon);

        if (len_icon > 0)
        {
            httpclient_stop ();

            int len_weather = httpclient (update_host, update_path, fname_weather);

            if (len_weather > 0)
            {
                assets_available = 1;
                httpclient_stop ();
            }
        }
    }

    if (httpclient (update_host, update_path, APP_BUNDLE_FILENAME) > 0)
    {
        app_bundle_available = 1;
        httpclient_stop ();
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":true,\"flash_size\":"));

    char buf[16];
    sprintf (buf, "%d", flashsize);
    http_send (buf);

    http_json_send_bool_field (FS("can_update"), flashsize >= 4194304UL);
    http_json_send_bool_field (FS("local_update_supported"), flashsize >= 1048576UL);
    http_json_send_string_field (FS("local_update_message"), http_get_local_update_message (flashsize));
    http_json_send_bool_field (FS("assets_available"), assets_available);
    http_json_send_bool_field (FS("app_bundle_available"), app_bundle_available);
    http_json_send_bool_field (FS("legacy_path_supported"), 1);
    http_json_send_bool_field (FS("device_ready_api_supported"), 1);
    http_json_send_bool_field (FS("reconnect_probe_api_supported"), 1);
    http_json_send_bool_field (FS("remote_esp_update_api_supported"), 0);
    http_json_send_bool_field (FS("settings_api_supported"), 1);
    http_json_send_bool_field (FS("display_power_api_supported"), 1);
    http_json_send_bool_field (FS("ambilight_power_api_supported"), 1);
    http_json_send_bool_field (FS("power_status_api_supported"), 1);
    http_json_send_bool_field (FS("update_download_assets_api_supported"), 1);
    http_json_send_bool_field (FS("update_download_app_bundle_api_supported"), 1);
    http_json_send_bool_field (FS("update_download_table_api_supported"), 1);
    http_json_send_bool_field (FS("app_bundle_upload_api_supported"), 1);
    http_json_send_bool_field (FS("fs_target_upload_api_supported"), 1);
    http_json_send_bool_field (FS("local_stm32_upload_api_supported"), 1);
    http_json_send_bool_field (FS("local_esp_update_api_supported"), 1);
    http_json_send_bool_field (FS("remote_stm32_flash_api_supported"), 1);

