granturism0/wordclock24h/ESP8266/ESP-uclock/http.cpp
    if (tables_filter)
    {
        len = httpclient (update_host, update_path, WC_TABLES_LIST_TXT);

        if (len > 0)
        {
            char fname[MAX_UPDATE_FILENAME_LEN];
            int ch;
            int l = 0;

            while (len > 0)
            {
                ch = httpclient_read (&len);

                if (ch != '\r' && ch != '\n' && ch != ' ' && ch != '\t' && l < MAX_UPDATE_FILENAME_LEN - 1)
                {
                    fname[l++] = ch;
                }
                else if (ch == '\n')
                {
                    fname[l] = '\0';
                    l = 0;

                    if (fname[0] && ! strncmp (fname, tables_filter, strlen (tables_filter)))
                    {
                        if (! first)
                        {
                            http_send (FS(","));
                        }

                        http_send (FS("\""));
                        http_send (sanitize_json_string (fname).c_str ());
                        http_send (FS("\""));
                        first = 0;
                    }
                }
            }

            httpclient_stop ();
        }
    }

    http_send (FS("]}"));
    http_flush ();

    return 0;
}

static void
reset_button (void)
{
    http_send_FS ("<form method=\"GET\" action=\"/flash_stm32_local\" style=\"display:inline\">"
                  "<button type=\"submit\" name=\"action\" value=\"reset\">Reset STM32</button>"
                  "</form>\r\n");

}

static uint_fast8_t
run_local_stm32_flash_response ()
{
    bool ok;

    http_header("Local Update", NULL, NULL);
    begin_box ("Local Update");

    for (int i = 0; i < 100; i++)
    {
        http_send ("          ");
    }

    LittleFS.begin ();
    update_progress_begin ("stm32", "starting", "Lokales STM32-Update wird vorbereitet.");
    ok = stm32_flash_from_local();
    LittleFS.remove ("stm32.hex");
    LittleFS.end ();

    if (ok)
    {
        update_progress_complete ("STM32-Flash abgeschlossen. Warte auf Reset.");
        http_send_FS ("Done. <font color=red>Please Reset your STM32 now!</font></B><BR>\r\n");
        reset_button ();
    }
    else if (! update_progress.error_code)
    {
        update_progress_fail (1, "Lokaler STM32-Flash fehlgeschlagen.");
    }

    end_box ();
    http_trailer ();
    http_flush ();
    return 0;
}

static uint_fast8_t
http_api_local_stm32_upload ()
{
    size_t      content_length = 0;
    uint32_t    flashsize = ESP.getFlashChipRealSize ();
    uint_fast8_t ok = 0;
    uint32_t    error_code = 0;
    char *      uploaded_name = http_get_param ("filename");

    if (flashsize < 1048576)
    {
        error_code = 1;
    }
    else if (! http_local_stm32_filename_matches (uploaded_name))
    {
        error_code = 2;
    }
    else if (read_post_headers (&content_length) && content_length > 0)
    {
        LittleFS.begin ();

        File f = LittleFS.open ("stm32.hex", "w+");

        if (f)
        {
            ok = read_request_body_to_file (f, content_length) ? 1 : 0;
            f.close ();

            if (! ok)
            {
                LittleFS.remove ("stm32.hex");
                error_code = 3;
            }
        }
        else
        {
            error_code = 4;
        }

        LittleFS.end ();
    }
    else
    {
        error_code = 5;
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");

    if (! ok)
    {
        http_send (FS(",\"error\":"));
        http_send (String (error_code).c_str ());
    }

    http_send (FS("}"));
    http_flush ();
    return 0;
}

static uint_fast8_t
http_api_local_stm32_flash ()
{
    uint_fast8_t exists = 0;

    LittleFS.begin ();
    exists = LittleFS.exists ("stm32.hex") ? 1 : 0;
    LittleFS.end ();

    if (exists)
    {
        return run_local_stm32_flash_response ();
    }

    http_send (FS("HTTP/1.0 404 Not Found\r\nContent-Type: text/plain\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("Keine lokale STM32-Datei vorhanden.\r\n"));
    http_flush ();
    return 0;
}

static int
http_api_remote_stm32_flash ()
{
    STR_VAR *       sv;
    char *          update_host;
    char *          update_path;
    char *          filename = http_get_param ("filename");
    uint32_t        flashsize = ESP.getFlashChipRealSize ();
    uint_fast8_t    ok = 0;
    uint32_t        error_code = 0;

    if (flashsize < 4194304)
    {
        error_code = 1;
    }
    else if (! http_remote_stm32_filename_matches (filename))
    {
        error_code = 2;
    }
    else
    {
        sv = get_strvar (UPDATE_HOST_VAR);
        update_host = sv->str;

        if (! update_host[0])
        {
            update_host = (char *) DEFAULT_UPDATE_HOST;
        }

        sv = get_strvar (UPDATE_PATH_VAR);
        update_path = sv->str;

        if (! update_path[0])
        {
            update_path = (char *) DEFAULT_UPDATE_PATH;
        }

        Serial.print ("Flash STM32: http://");
        Serial.print (update_host);
        Serial.print ("/");
        Serial.print (update_path);
        Serial.print ("/");
        Serial.println (filename);

        delay (200);
        update_progress_begin ("stm32", "starting", "STM32-Update wird vorbereitet.");
        ok = stm32_flash_from_server (update_host, update_path, filename) ? 1 : 0;
        delay (200);
        Serial.println ("End of flashmode\r\n");
        Serial.flush ();

        if (ok)
        {
            update_progress_complete ("STM32-Flash abgeschlossen. Warte auf Reset.");
        }
        else if (! update_progress.error_code)
        {
            update_progress_fail (1, "STM32-Flash fehlgeschlagen.");
        }
    }

    http_send (FS("HTTP/1.0 200 OK\r\nContent-Type: application/json\r\nCache-Control: no-cache\r\n\r\n"));
    http_send (FS("{\"ok\":"));
    http_send (ok ? "true" : "false");

    if (! ok)
    {
        http_send (FS(",\"error\":"));
        http_send (String (error_code ? error_code : update_progress.error_code).c_str ());
        http_send (FS(",\"message\":\""));
        http_send (sanitize_json_string (update_progress.message).c_str ());
        http_send (FS("\""));
    }

    http_send (FS("}"));
    http_flush ();
    return 0;
}

static uint_fast8_t
http_api_local_esp_update ()
{
    size_t      content_length = 0;
    uint32_t    max_sketch_space = (ESP.getFreeSketchSpace () - 0x1000) & 0xFFFFF000;
    uint_fast8_t ok = 0;
    uint16_t    error_code = 0;
    char *      uploaded_name = http_get_param ("filename");
    size_t      bytes_written = 0;
    size_t      skipped = 0;
    size_t      first_chunk_len = 0;
    uint_fast8_t begin_ok = 0;
    uint_fast8_t stream_ok = 0;
    uint_fast8_t end_ok = 0;
    size_t      progress_before_end = 0;
    size_t      remaining_before_end = 0;
    uint8_t     first_chunk[8];

    if (! http_local_esp_filename_matches (uploaded_name))
    {
        error_code = 1002;
    }
    else if (read_post_headers (&content_length) && content_length > 0 && content_length < max_sketch_space)
    {
        update_progress_begin ("esp", "starting", "Lokales ESP-Update wird vorbereitet.");
        Update.runAsync (true);
        skipped = skip_leading_body_newlines ();

        if (Update.begin (max_sketch_space, U_FLASH))
        {
            begin_ok = 1;

            while (first_chunk_len < sizeof (first_chunk) && first_chunk_len < content_length)
            {
                unsigned long start_millis = millis ();

                while (! http_client.available () && (millis () - start_millis) < READ_BODY_TIMEOUT)
                {
                    yield ();
                }

                if (! http_client.available ())
                {
                    break;
                }

